# CreateVP

## Description
Creates a viewport object. The specified parent handle may only be a layer or a group contained within a layer, nested or otherwise.

```pascal
FUNCTION CreateVP(parentHandle : HANDLE) : HANDLE;
```

```python

def vs.CreateVP(parentHandle):
    return HANDLE
```

## Parameters
|Name|Type|Description|
|---|---|---|
|parentHandle|HANDLE||

## Version
Availability: from VectorWorks11.0
## Category
* Objects - Groups